modules/connectors/postat/vendor/request_leer.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:post="http://post.ondot.at" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:core="http://Core.Model" xmlns:ser="http://schemas.microsoft.com/2003/10/Serialization/">
   <soapenv:Header/>
   <soapenv:Body>
      <post:ImportShipment>
         <!--Optional:-->
         <post:row>
            <!--Optional:alternative Rücksendeadresse-->
            <post:AlternativeReturnOrgUnitAddress>
               <!--Optional:-->
               <post:AddressLine1>?</post:AddressLine1>
               <!--Optional:-->
               <post:AddressLine2>?</post:AddressLine2>
               <!--Optional:-->
               <post:City>?</post:City>
               <!--Optional:-->
               <post:CountryID>?</post:CountryID>
               <!--Optional:-->
               <post:EORINumber>?</post:EORINumber>
               <!--Optional:-->
               <post:Email>?</post:Email>
               <!--Optional:-->
               <post:Fax>?</post:Fax>
               <!--Optional:-->
               <post:Homepage>?</post:Homepage>
               <!--Optional:-->
               <post:HouseNumber>?</post:HouseNumber>
               <!--Optional:-->
               <post:Name1>?</post:Name1>
               <!--Optional:-->
               <post:Name2>?</post:Name2>
               <!--Optional:-->
               <post:Name3>?</post:Name3>
               <!--Optional:-->
               <post:Name4>?</post:Name4>
               <!--Optional:-->
               <post:PersonalTaxNumber>?</post:PersonalTaxNumber>
               <!--Optional:-->
               <post:PostalCode>?</post:PostalCode>
               <!--Optional:-->
               <post:ProvinceCode>?</post:ProvinceCode>
               <!--Optional:-->
               <post:Tel1>?</post:Tel1>
               <!--Optional:-->
               <post:Tel2>?</post:Tel2>
               <!--Optional:-->
               <post:ThirdPartyID>?</post:ThirdPartyID>
               <!--Optional:-->
               <post:VATID>?</post:VATID>
            </post:AlternativeReturnOrgUnitAddress>
            <!--Optional:Dokumentenarten die vom Absender angefordert werden zb bei Zollinformationen-->
            <post:BusinessDocumentEntryList>
               <!--Zero or more repetitions:-->
               <arr:string>?</arr:string>
            </post:BusinessDocumentEntryList>
            <!--Optional:-->
            <post:ClientID>?</post:ClientID>
            <!--Optional:-->
            <post:ColloList>
               <!--Zero or more repetitions:-->
               <post:ColloRow>
                  <!--Optional:-->
                  <post:ColloArticleList>
                     <!--Zero or more repetitions:-->
                     <post:ColloArticleRow>
                        <!--Optional:-->
                        <post:ArticleName>?</post:ArticleName>
                        <!--Optional:-->
                        <post:ArticleNumber>?</post:ArticleNumber>
                        <!--Optional:-->
                        <post:ConsumerUnitNetWeight>?</post:ConsumerUnitNetWeight>
                        <!--Optional:-->
                        <post:CountryOfOriginID>?</post:CountryOfOriginID>
                        <!--Optional:-->
                        <post:CurrencyID>?</post:CurrencyID>
                        <!--Optional:-->
                        <post:CustomsOptionID>?</post:CustomsOptionID>
                        <!--Optional:-->
                        <post:HSTariffNumber>?</post:HSTariffNumber>
                        <!--Optional:-->
                        <post:Quantity>?</post:Quantity>
                        <!--Optional:-->
                        <post:UnitID>?</post:UnitID>
                        <!--Optional:-->
                        <post:ValueOfGoodsPerUnit>?</post:ValueOfGoodsPerUnit>
                     </post:ColloArticleRow>
                  </post:ColloArticleList>
                  <!--Optional:-->
                  <post:ColloCodeList>
                     <!--Zero or more repetitions:-->
                     <post:ColloCodeRow>
                        <!--Optional:-->
                        <post:Code>?</post:Code>
                        <!--Optional:-->
                        <post:NumberTypeID>?</post:NumberTypeID>
                        <!--Optional:-->
                        <post:OUCarrierThirdPartyID>?</post:OUCarrierThirdPartyID>
                     </post:ColloCodeRow>
                  </post:ColloCodeList>
                  <!--Optional:-->
                  <post:Height>?</post:Height>
                  <!--Optional:-->
                  <post:Length>?</post:Length>
                  <!--Optional:-->
                  <post:Weight>?</post:Weight>
                  <!--Optional:-->
                  <post:Width>?</post:Width>
               </post:ColloRow>
            </post:ColloList>
            <!--Optional:-->
            <post:CostCenterThirdPartyID>?</post:CostCenterThirdPartyID>
            <!--Optional:-->
            <post:CustomDataBit1>?</post:CustomDataBit1>
            <!--Optional:-->
            <post:CustomDataBit2>?</post:CustomDataBit2>
            <!--Optional:-->
            <post:CustomsDescription>?</post:CustomsDescription>
            <!--Optional:-->
            <post:DeliveryInstruction>?</post:DeliveryInstruction>
            <!--Optional:-->
            <post:DeliveryServiceThirdPartyID>?</post:DeliveryServiceThirdPartyID>
            <!--Optional:-->
            <post:FeatureList>
               <!--Zero or more repetitions:-->
               <post:AdditionalInformationRow>
                  <!--Optional:-->
                  <post:ThirdPartyID>?</post:ThirdPartyID>
                  <!--Optional:-->
                  <post:Value1>?</post:Value1>
                  <!--Optional:-->
                  <post:Value2>?</post:Value2>
                  <!--Optional:-->
                  <post:Value3>?</post:Value3>
                  <!--Optional:-->
                  <post:Value4>?</post:Value4>
               </post:AdditionalInformationRow>
            </post:FeatureList>
            <!--Optional:-->
            <post:MovementReferenceNumber>?</post:MovementReferenceNumber>
            <!--Optional:-->
            <post:Number>?</post:Number>
            <!--Optional:Empfängeradresse-->
            <post:OURecipientAddress>
               <!--Optional:-->
               <post:AddressLine1>?</post:AddressLine1>
               <!--Optional:-->
               <post:AddressLine2>?</post:AddressLine2>
               <!--Optional:-->
               <post:City>?</post:City>
               <!--Optional:-->
               <post:CountryID>?</post:CountryID>
               <!--Optional:-->
               <post:EORINumber>?</post:EORINumber>
               <!--Optional:-->
               <post:Email>?</post:Email>
               <!--Optional:-->
               <post:Fax>?</post:Fax>
               <!--Optional:-->
               <post:Homepage>?</post:Homepage>
               <!--Optional:-->
               <post:HouseNumber>?</post:HouseNumber>
               <!--Optional:-->
               <post:Name1>?</post:Name1>
               <!--Optional:-->
               <post:Name2>?</post:Name2>
               <!--Optional:-->
               <post:Name3>?</post:Name3>
               <!--Optional:-->
               <post:Name4>?</post:Name4>
               <!--Optional:-->
               <post:PersonalTaxNumber>?</post:PersonalTaxNumber>
               <!--Optional:-->
               <post:PostalCode>?</post:PostalCode>
               <!--Optional:-->
               <post:ProvinceCode>?</post:ProvinceCode>
               <!--Optional:-->
               <post:Tel1>?</post:Tel1>
               <!--Optional:-->
               <post:Tel2>?</post:Tel2>
               <!--Optional:-->
               <post:ThirdPartyID>?</post:ThirdPartyID>
               <!--Optional:-->
               <post:VATID>?</post:VATID>
            </post:OURecipientAddress>
            <!--Optional:Absenderadresse-->
            <post:OUShipperAddress>
               <!--Optional:-->
               <post:AddressLine1>?</post:AddressLine1>
               <!--Optional:-->
               <post:AddressLine2>?</post:AddressLine2>
               <!--Optional:-->
               <post:City>?</post:City>
               <!--Optional:-->
               <post:CountryID>?</post:CountryID>
               <!--Optional:-->
               <post:EORINumber>?</post:EORINumber>
               <!--Optional:-->
               <post:Email>?</post:Email>
               <!--Optional:-->
               <post:Fax>?</post:Fax>
               <!--Optional:-->
               <post:Homepage>?</post:Homepage>
               <!--Optional:-->
               <post:HouseNumber>?</post:HouseNumber>
               <!--Optional:-->
               <post:Name1>?</post:Name1>
               <!--Optional:-->
               <post:Name2>?</post:Name2>
               <!--Optional:-->
               <post:Name3>?</post:Name3>
               <!--Optional:-->
               <post:Name4>?</post:Name4>
               <!--Optional:-->
               <post:PersonalTaxNumber>?</post:PersonalTaxNumber>
               <!--Optional:-->
               <post:PostalCode>?</post:PostalCode>
               <!--Optional:-->
               <post:ProvinceCode>?</post:ProvinceCode>
               <!--Optional:-->
               <post:Tel1>?</post:Tel1>
               <!--Optional:-->
               <post:Tel2>?</post:Tel2>
               <!--Optional:-->
               <post:ThirdPartyID>?</post:ThirdPartyID>
               <!--Optional:-->
               <post:VATID>?</post:VATID>
            </post:OUShipperAddress>
            <!--Optional:-->
            <post:OUShipperReference1>?</post:OUShipperReference1>
            <!--Optional:-->
            <post:OUShipperReference2>?</post:OUShipperReference2>
            <!--Optional:-->
            <post:OrgUnitGuid>?</post:OrgUnitGuid>
            <!--Optional:-->
            <post:OrgUnitID>?</post:OrgUnitID>
            <!--Optional:Druckereinstellungen-->
            <post:PrinterObject>
               <!--Optional:encoding für zpl2-druck: UTF-8 (standard) oder WINDOWS-1252-->
               <post:Encoding>?</post:Encoding>
               <!--Optional:Etikettengröße 100x150 oder 100x200-->
               <post:LabelFormatID>?</post:LabelFormatID>
               <!--Optional:PDF oder ZPL2-->
               <post:LanguageID>?</post:LanguageID>
               <!--Optional:papierlayout für pdf-druck: 2xA5inA4 oder 4xA6inA4 oder A4"-->
               <post:PaperLayoutID>?</post:PaperLayoutID>
            </post:PrinterObject>
            <!--Optional:-->
            <post:ReturnDays>?</post:ReturnDays>
            <!--Optional:-->
            <post:ReturnModeID>?</post:ReturnModeID>
            <!--Optional:-->
            <post:ReturnOptionID>?</post:ReturnOptionID>
            <!--Optional:-->
            <post:ShipmentDocumentEntryList>
               <!--Zero or more repetitions:Dokumente die der Sendung beiliegen zB eine Rechnung-->
               <core:ShipmentDocumentEntry ser:Id="?" ser:Ref="?">
                  <!--Optional:-->
                  <core:DocumentID>?</core:DocumentID>
                  <!--Optional:-->
                  <core:ID>?</core:ID>
                  <!--Optional:-->
                  <core:Number>?</core:Number>
                  <!--Optional:-->
                  <core:Quantity>?</core:Quantity>
                  <!--Optional:-->
                  <core:ShipmentID>?</core:ShipmentID>
               </core:ShipmentDocumentEntry>
            </post:ShipmentDocumentEntryList>
            <!--Optional:-->
            <post:ShippingDateTimeFrom>?</post:ShippingDateTimeFrom>
            <!--Optional:-->
            <post:ShippingDateTimeTo>?</post:ShippingDateTimeTo>
         </post:row>
      </post:ImportShipment>
   </soapenv:Body>
</soapenv:Envelope>